// health.component.ts

import { Component } from '@angular/core';
import { NgForOf } from '@angular/common';
@Component({
  selector: 'app-health',
  templateUrl: './health.html',
  styleUrls: ['./health.css'],
  imports: [NgForOf]
})
export class Health {

  featuredNews = {
    category: 'स्वास्थ्य',
    title: 'मुटु रोग उपचारमा नयाँ प्रविधिको सफल परीक्षण',
    description:
      'विशेषज्ञ चिकित्सकहरूले मुटु सम्बन्धी रोगको उपचारका लागि नयाँ प्रविधिको सफल परीक्षण गरेका छन् जसले बिरामीको स्वास्थ्य सुधारमा महत्वपूर्ण भूमिका खेल्ने विश्वास गरिएको छ।',
    image: "./health/marketing.jpg",
    author: 'समाचार डेस्क',
    date: '२२ मे २०२६'
  };

  healthNews = [
    {
      category: 'फिटनेस',
      title: 'दैनिक व्यायामले मानसिक तनाव कम गर्ने विज्ञहरूको सुझाव',
      description:
        'स्वास्थ्य विशेषज्ञहरूका अनुसार नियमित व्यायामले मानसिक स्वास्थ्य सुधार गर्न सहयोग पुर्‍याउँछ।',
      image:"./health/health1.jpg",
            time: '२ घण्टा अघि'
    },

    {
      category: 'पोषण',
      title: 'सन्तुलित भोजनले शरीरलाई स्वस्थ राख्न मद्दत गर्ने',
      description:
        'पोषणविद्हरूले स्वस्थ जीवनशैलीका लागि पौष्टिक आहार आवश्यक रहेको बताएका छन्।',
      image: "./health/health3.jpg",
      time: '५ घण्टा अघि'
    },

    {
      category: 'मानसिक स्वास्थ्य',
      title: 'युवापुस्तामा मानसिक स्वास्थ्य सचेतना बढ्दै',
      description:
        'विद्यालय र विभिन्न संस्थाहरूले मानसिक स्वास्थ्यसम्बन्धी जनचेतना कार्यक्रमलाई प्राथमिकता दिएका छन्।',
      image: "./health/health2.jpg",
      time: '८ घण्टा अघि'
    }
  ];

  trendingNews = [
    'पर्याप्त निद्राले रोग प्रतिरोधात्मक क्षमता बढाउने अध्ययन',
    'प्रशोधित खाद्य पदार्थको अत्यधिक सेवन नगर्न चिकित्सकको सुझाव',
    'स्वस्थ जीवनका लागि दैनिक ३० मिनेट हिँड्न विज्ञहरूको आग्रह',
    'विश्व स्वास्थ्य संगठनद्वारा मानसिक स्वास्थ्यमा जोड'
  ];

}